-- -----------------------------------------------------
-- заполнение данных временными тестовыми данными, для проверки работы внешнего ключа
-- -----------------------------------------------------
INSERT INTO `roulette_users` (`user_id`,`name`,`data`,`created`,`banned`) VALUES
    (8,'111',NULL,'2026-05-29 22:18:41',0),
    (9,'222',NULL,'2026-05-29 22:18:41',0),
    (11,'444',NULL,'2026-05-29 22:18:41',0);

INSERT INTO `roulette_score` (`user_id`,`score`,`created`) VALUES
    (8,23456,'2026-05-29 22:18:58'),
    (11,2343456,'2026-05-29 22:20:10'),
    (8,2323234,'2026-05-29 22:20:25');

CALL CreateNewSession('{}', @sessionid);

INSERT INTO `roulette_session` (`sessionid`,`user_id`,`userdata`) VALUES
    ('101922269126721541',8,'{}');

